#Если Сервер или ТолстыйКлиентОбычноеПриложение или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Процедура добавляет резульатат тестирования в регистр
// 
// Параметры:
//  Задача - СправочникСсылка.ИТК_Задачи - задача тестирования
//  Пользователь - Строка - участник тестирования
//  Выполнена - Булево - тесты по задаче завершены успешно
//  ТекстАлгоритмаСервер - Строка - код алгоритма
//  Баллы - Число - количество баллов за верное решение
//
Процедура Добавить(Задача, Пользователь, Выполнена, ТекстАлгоритмаСервер, Баллы) Экспорт

	НоваяЗапись = РегистрыСведений.ИТК_РезультатыТестирования.СоздатьМенеджерЗаписи();   
	НоваяЗапись.Задача = Задача;
	НоваяЗапись.Пользователь = Пользователь;
	НоваяЗапись.Выполнена = Выполнена;
	НоваяЗапись.Код = ТекстАлгоритмаСервер;
	НоваяЗапись.КоличествоБаллов = Баллы;
	НоваяЗапись.Записать(Истина);

КонецПроцедуры

#КонецОбласти
		
#КонецЕсли